БПКР/src/InformationRegisters/НастройкиОтчетов/НастройкиОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиОтчетов</name>
  <resources>
    <name>ВыводитьМестоДляШтампа</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектОтчет</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БПКР/src/CommonModules/БухгалтерскиеОтчетыПовтИсп/Module.bsl
#Область ПрограммныйИнтерфейс

// Получает данные из регистра сведений Настройки отчетов
//
// Параметры:
//  ОбъектОтчет  - СправочникСсылка.ИдентификаторыОбъектовМетаданных - Отчет для отбора
//
// Возвращаемое значение:
//   Структура   - настройки отчета
//
Функция ПолучитьНастройкиОтчета(ОбъектОтчет) Экспорт
	
	НастройкиОтчета = Новый Структура;
	НастройкиОтчета.Вставить("ВыводитьМестоДляШтампа", Ложь);
	
	НаборЗаписей = РегистрыСведений.НастройкиОтчетов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОбъектОтчет.Установить(ОбъектОтчет);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда 
		ЗаполнитьЗначенияСвойств(НастройкиОтчета, НаборЗаписей[0]);
	КонецЕсли;	
	
	Возврат НастройкиОтчета;
	
КонецФункции

// Функция - Получить имя макета оформления
// 
// Возвращаемое значение:
//  МакетОформления - Строка
//
Функция ПолучитьИмяМакетаОформления() Экспорт

	МакетОформления = Константы.МакетОформленияОтчетов.Получить();
	
	Если МакетОформления = "Бежевый" Тогда 
		Возврат "ОформлениеОтчетовБежевый";
	ИначеЕсли МакетОформления = "Строгий" Тогда	
		Возврат "ОформлениеОтчетовСтрогий";
	ИначеЕсли МакетОформления = "Черно-белый" Тогда	
		Возврат "ОформлениеОтчетовЧерноБелый";
	Иначе 
		Возврат МакетОформления;
	КонецЕсли;	

КонецФункции // ПолучитьИмяМакетаОформления()

#КонецОбласти
